// Console.WriteLine("Hello World!");


// C# ობიექტზე ორიენტირებული (OOP)  პროგრამირების ენა.  შემუშავებული microsoft-ის მიერ.

// C# არის ობიექტზე ორიენტირებული ტიპიზირებული ენა რაც ნიშნავს იმას რომ მას აქვს მხარდაჭერა
// კლასების, ობიექტების, მემკვირდეობის (Inheritance) და პოლიმორფიზმის (Polimorphism).

// რას ნიშნავს ტიპიზირებული ენა?
//ტიპიზირებულიე ენა ნიშნავს იმას რომ ყველა ცვლადს სტატიკურად უნდა გავუწეროთ მისი ტიპი
// ასევე C#-ში აუცილებელია ყოველი ხაზის ბოლოს დავწეროთ ; (წერტილ-მძიმე)
// სხვაგვარად კომპილატორი Error-ს გამოიტანს. "; expected"

// ტიპიზირების მაგალითი:
int age = 25;

string name = "John Doe";

bool hasDog = false;

// ეს განაპირობებს ტიპის უსაფრთხოებას, რაც გვაძლევს უკეთ წაკითხვად კოდს.
// ასევე შეგვიძლია შეცდომები აღმოვფხვრათ ადრეულ ეტაპებზე.

// მაგრამ C#-ში მაინც გვაქვს საშუალება არ გამოვიყენოთ ტიპიზირებული ცვლადები და ირიბად მივანიჭოთ მას ტიპი.
// ამისთვის გამოიყენება ცვლადი var რომელიც  (compile time)-ის დროს ანუ უშუალოდ კოდის გაშვებისას თავისით მიანიჭებს ტიპებს

var distance = 25;

var city = "Gori";



// .Net Framework შემუშავებულია Microsoft-ის მიერ. გამოიყენება Desktop აპლიკაციებში, ვებსაიტებში და სხვადასხვა სერვისებში.
// ხშირად გამოიყენება ისეთ ადგილებში სადაც სტაბილურობა არის მნიშვნელოვანი.
// .Net Frameworks აქვს ფართო არჩევანი ბიბლიოთეკების რომლებიც მასთან მუშაობას ამარტივებს.
// .Net Framework-ზე არის აწყობილი ისეთი საიტების Backend-ი როგორიცაა

// https://www.microsoft.com/en-us/
// https://www.Outlook.com
// https://www.StackOverflow.com
// https://www.w3schools.com

// .Net Framework-თან ერთად გამოიყენება კიდევ ერთ-ერთი Framework-ი Web-აპლიკაციების და Web-API-ების შესაქმნელად
// ეს არის ASP.NET Web-Framework რომელიც კიდევ უსასრულო შესაძლებლობებს გვაძლევს.



// ცვლადები / ცვლადები C#-ში

// ცვლადების მთელი აზრი C#-ში არის ის რომ რაღაც მონაცემი შევინახოთ და შემდგომ მთელი აპლიკაციის
// მასშტაბით მოვახდინოთ სხვადასხვა მანიპულაციები ამ მონაცემზე. ამისთვის საჭიროა ცვლადის ტიპი, სახელი და მონაცემი რომელსაც ვინახავთ.

int studentAge = 15;
// ტიპი: int
// სახელი: studentAge
// მონაცემი: 15

// C#-ის ცვლადის ტიპები:

// მოგეხსნებათ C#-ი არის მყარად ტიპიზირებული ენა რაც ნიშნავს იმას რომ ყველა ცვლადზე გვაქვს საშუალება იმისა რომ მივანიჭოთ ტიპი
// ეს ტიპებია:

bool boolVariable = true; // გამოიყენება ლოგიკური მნიშვნელობების შესანახად, როგორიცაა true ან false.

// 8-BIT
byte byteVariable = 255; // გამოიყენება პატარა რიცხვების შესანახად 0-დან 255-მდე.

// 8-BIT
sbyte sbyteVariable = -128; // გამოიყენება მცირე რიცხვების შესანახად -128-დან 127-მდე დიაპაზონში.

// 16-BIT
char charVariable = 'A'; // გამოიყენება ერთი სიმბოლოს შესანახად.

// 16-BIT
decimal decimalVariable = 10.5m;  // გამოიყენება არამთელი რიცხვების მაღალი სიზუსტით შესანახად, ხშირად გამოიყენება ფინანსურ გამოთვლებში.

// 64-BIT
double doubleVariable = 3.14; // გამოიყენება არა მთელი რიცხვების შესანახად ნაკლები სიზუსტიდ

// 32-BIT
float floatVariable = 2.5f; // გამოიყენება არა მთელი რიცხვების შესანახად კიდევ უფრო ნაკლები სიზუსტით

// 32-BIT
int intVariable = 42; // გამოიყენება მთელი რიცხვების შესანახად დაახლოებით -2 მილიარდიდან 2 მილიარდამდე დიაპაზონში..

uint uintVariable = 100; // გამოიყენება დადებითი მთელი რიცხვების შესანახად 0-დან 4 მილიარდამდე.

// 64-BIT
long longVariable = 1234567890L;
// გამოიყენება დიდი რიცხვების შესანახად დაახლოებით -9 კვინტილიონიდან 9 კვინტილიონამდე დიაპაზონში.

// 64-BIT
ulong ulongVariable = 9876543210UL; // გამოიყენება დიდი რიცხვების შესანახად დაახლოებით 0 კვინტილიონიდან 18 კვინტილიონამდე დიაპაზონში.

// 16-BIT
short shortVariable = -32000; // გამოიყენება მცირე რიცხვების შესანახად დაახლოებით -32000-დან 32000-მდე დიაპაზონში.

// 16-BIT
ushort ushortVariable = 64000; // გამოიყენება დადებითი მთელი რიცხვების შესანახად 0-დან 65000-მდე.

// Console.WriteLine("")

Console.WriteLine("Hello Please Tell Me Your Age");
int usersAge = Convert.ToInt16(Console.ReadLine());

Console.WriteLine("Users Age Is: " + usersAge);
// გამოტანის მეორე ვარიანტი სტრინგის ინტერპოლაციით
Console.WriteLine($"Users Age Is: {usersAge}");


// საკლასო დავალება
// მომხმარებელს შემოვაყვანინოთ სახელი/ასაკი/სქესი
// გამოვიტანოთ ეს ყველაფერი კონსოლში.


// Quiz-ი
// https://api.socrative.com/rc/AnqQfb


